# =======================================================================================================
# Exercises Part I (11) START
# =======================================================================================================

### 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [24]:
def green(text):
    print('\033[32m' + text + '\033[0m')
green('COMPLETED')

COMPLETED

### 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [25]:
green('COMPLETED')

COMPLETED

### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [26]:
green('COMPLETED')

COMPLETED

### 4. Use your function to obtain a connection to the employees database.

In [27]:
import env
import pandas as pd
import numpy as np
employees_db = env.get_db_url('employees')
green('COMPLETED')

COMPLETED

### 5. Once you have successfully run a query:
### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [28]:
green('COMPLETED')
env.get_db_url()

COMPLETED

TypeError: get_db_url() missing 1 required positional argument: 'db'

### b. Intentionally make an error in your SQL query. What does the error message look like?

In [30]:
green('COMPLETED')
pd.read_sql(
'''
SELECT *
FROM employees
GROUP BY the macarana
''', employees_db
)

COMPLETED

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'macarana' at line 3")
[SQL:
SELECT *
FROM employees
GROUP BY the macarana
]
(Background on this error at: https://sqlalche.me/e/14/f405)

### 6. Read the employees and titles tables into two separate DataFrames.

In [177]:
employees_table = pd.read_sql(
        '''
        SELECT *
        FROM employees
        ''', employees_db
        )

In [38]:
titles_table = pd.read_sql(
        '''
        SELECT *
        FROM titles
        ''', employees_db
        )

### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

Employees:
    Rows: 300024
    Columns: 6
    
Titles:
    Rows: 443308
    Columns: 4
    
Expectations:
Yes, I'd expect the query to return the same results as it would in 'MySQL'

### 8. Display the summary statistics for each DataFrame.

In [42]:
print(employees_table.describe())
print(titles_table.describe())

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000
              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9. How many unique titles are in the titles DataFrame?

In [56]:
len(titles_table.title.unique())

7

In [57]:
pd.read_sql(
        '''
        SELECT COUNT(title) AS total_titles
        FROM(
            SELECT DISTINCT title
            FROM titles
            ) AS A
        ''', employees_db
)

   total_titles
0             7

### 10. What is the oldest date in the to_date column?

In [58]:
titles_table.to_date.min()

datetime.date(1985, 3, 1)

In [51]:
pd.read_sql(
        '''
        SELECT MIN(to_date) AS oldest_date
        FROM titles
        ''', employees_db
)

  oldest_date
0  1985-03-01

### 11. What is the most recent date in the to_date column?

In [59]:
titles_table.to_date.max()

datetime.date(9999, 1, 1)

In [60]:
titles_table.to_date[titles_table.to_date != titles_table.to_date.max()].max()

datetime.date(2002, 8, 1)

In [52]:
pd.read_sql(
        '''
        SELECT MAX(to_date) AS recent_date
        FROM titles
        ''', employees_db
)

  recent_date
0  9999-01-01

# =======================================================================================================
# Exercises Part I (11) END
# Exercises Part I (11) TO Exercises Part II (16)
# Exercises Part II (16) START
# =======================================================================================================

### 1. Copy the users and roles DataFrames from the examples above.

In [61]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [62]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

### 2. What is the result of using a right join on the DataFrames?

In [194]:
pd.merge(users, roles, how='right', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

### 3. What is the result of using an outer join on the DataFrames?

In [191]:
pd.merge(users, roles, how='outer', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [137]:
pd.merge(users, roles, left_on=True, right_on=True)

KeyError: True

### 5. Load the mpg dataset from PyDataset.

In [71]:
import pydataset
mpg = pydataset.data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

### 6. Output and read the documentation for the mpg dataset.

In [197]:
pydataset.data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

### 7. How many rows and columns are in the dataset?

In [73]:
mpg.shape

(234, 11)

### 8. Check out your column names and perform any cleanup you may want on them.

In [77]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

### 9. Display the summary statistics for the dataset.

In [198]:
mpg.describe().round(1)

       displ    year    cyl    cty    hwy  mileage_difference  average_mileage
count  234.0   234.0  234.0  234.0  234.0               234.0            234.0
mean     3.5  2003.5    5.9   16.9   23.4                 6.6             20.1
std      1.3     4.5    1.6    4.3    6.0                 2.3              5.1
min      1.6  1999.0    4.0    9.0   12.0                 2.0             10.5
25%      2.4  1999.0    4.0   14.0   18.0                 5.0             15.5
50%      3.3  2003.5    6.0   17.0   24.0                 7.0             20.5
75%      4.6  2008.0    8.0   19.0   27.0                 8.0             23.5
max      7.0  2008.0    8.0   35.0   44.0                12.0             39.5

### 10. How many different manufacturers are there?

In [199]:
mpg.manufacturer.nunique()

15

### 11. How many different models are there?

In [200]:
mpg.model.nunique()

38

### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [97]:
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty']
mpg.head(5)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [110]:
mpg['average_mileage'] = (mpg[['cty', 'hwy']].sum(axis=1) / 2).round(1)

In [116]:
mpg.head(5)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [113]:
mpg.trans.unique()

array(['auto(l5)', 'manual(m5)', 'manual(m6)', 'auto(av)', 'auto(s6)',
       'auto(l4)', 'auto(l3)', 'auto(l6)', 'auto(s5)', 'auto(s4)'],
      dtype=object)

In [114]:
mpg['is_automatic'] = np.where(mpg.trans.str.startswith('auto'), True, False)

In [115]:
mpg.head(5)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [206]:
mpg.groupby('manufacturer')['average_mileage'].mean().round(1).nlargest(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

### 16. Do automatic or manual cars have better miles per gallon?

In [136]:
mpg.groupby('is_automatic')['average_mileage'].mean().round(1)
# Automatic: 19.1mpg
# Manual: 22.2mpg

is_automatic
False    22.2
True     19.1
Name: average_mileage, dtype: float64

# =======================================================================================================
# Exercises Part II (16) END
# Exercises Part II (16) TO Exercises Part III (7)
# Exercises Part III (7) START
# =======================================================================================================

### 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [139]:
chipotle_db = env.get_db_url('chipotle')

### 2. What is the total price for each order?

In [160]:
orders_table = pd.read_sql(
                        '''
                        SELECT *
                        FROM orders
                        ''', chipotle_db
                        )

In [161]:
orders_table.head(5)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [162]:
orders_table.item_price = orders_table.item_price.str.strip('$').astype(float)

In [163]:
orders_table.item_price

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [164]:
orders_table.groupby('order_id')['item_price'].agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

### 3. What are the most popular 3 items?

In [172]:
orders_table.groupby('item_name')['quantity'].agg('sum').sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

### 4. Which item has produced the most revenue?

In [176]:
orders_table.groupby('item_name')['item_price'].agg('sum').sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

### 5. Join the employees and titles DataFrames together.

In [187]:
emp_title_table = pd.merge(employees_table,titles_table, how='left', on='emp_no')
emp_title_table

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [189]:
emp_title_table.title.unique() = emp_title_table.to_date == '9999-01-01'

SyntaxError: cannot assign to function call (1886451220.py, line 1)

### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

# =======================================================================================================
# Exercises Part III (7) END
# Exercises Part III (7) TO Extra Pandas Exercises and Resources
# Extra Pandas Exercises and Resources START
# =======================================================================================================

### https://www.w3resource.com/python-exercises/pandas/index.php
### https://towardsdatascience.com/20-pandas-functions-that-will-boost-your-data-analysis-process-f5dfdb2f9e05
### https://github.com/guipsamora/pandas_exercises
### https://github.com/ajcr/100-pandas-puzzles

# =======================================================================================================
# Extra Pandas Exercises and Resources END
# Extra Pandas Exercises and Resources TO More Practice!
# More Practice! START
# =======================================================================================================

### For even more practice with pandas, you can do the exercises from the SQL module, but instead of using SQL to do the aggregation, sorting, joining, etc, use pandas. That is, read the data from all of the tables into pandas dataframes and manipulate the dataframes.

# =======================================================================================================
# More Practice! END
# =======================================================================================================